-- 由 Tools/ConfigEditor/exporter.mjs 自动生成，请勿手动修改。
---@class PartyStoryRuleTableRow
---@field id number 规则 ID
---@field rescueHealthPercent number 被救者治疗前生命不高于最大生命的百分比
---@field rescueBond number 真实救援增加的关系值
---@field victoryBond number 共同胜利且双方存活增加的关系值
---@field removeTraitIds number[] 真实获救后移除的特质
return {["name"]="PartyStoryRuleTable",["key"]="id",["fields"]={{["name"]="id",["type"]="int",["description"]="\232\167\132\229\136\153 ID",["min"]=1},{["name"]="rescueHealthPercent",["type"]="int",["description"]="\232\162\171\230\149\145\232\128\133\230\178\187\231\150\151\229\137\141\231\148\159\229\145\189\228\184\141\233\171\152\228\186\142\230\156\128\229\164\167\231\148\159\229\145\189\231\154\132\231\153\190\229\136\134\230\175\148",["min"]=1,["max"]=99},{["name"]="rescueBond",["type"]="int",["description"]="\231\156\159\229\174\158\230\149\145\230\143\180\229\162\158\229\138\160\231\154\132\229\133\179\231\179\187\229\128\188",["min"]=1,["max"]=100},{["name"]="victoryBond",["type"]="int",["description"]="\229\133\177\229\144\140\232\131\156\229\136\169\228\184\148\229\143\140\230\150\185\229\173\152\230\180\187\229\162\158\229\138\160\231\154\132\229\133\179\231\179\187\229\128\188",["min"]=1,["max"]=100},{["name"]="removeTraitIds",["type"]="int[]",["description"]="\231\156\159\229\174\158\232\142\183\230\149\145\229\144\142\231\167\187\233\153\164\231\154\132\231\137\185\232\180\168",["ref"]="CombatTraitTable"}},["fingerprint"]="262cf331b8897bfc268fa43a64049cbdc1846f78703d5cc5633900499ccf8349"}
