-- 由 Tools/ConfigEditor/exporter.mjs 自动生成，请勿手动修改。
---@class PawnTemplateTableRow
---@field id number 稳定外观模板 ID
---@field name string 模板名称
---@field unitId number 角色模板 ID；每个角色模板只能对应一个初始外观
---@field partIds number[] 部件组合；必须包含身体和底座，其余插槽可不装备
return {["name"]="PawnTemplateTable",["key"]="id",["fields"]={{["name"]="id",["type"]="int",["description"]="\231\168\179\229\174\154\229\164\150\232\167\130\230\168\161\230\157\191 ID",["min"]=1},{["name"]="name",["type"]="text",["description"]="\230\168\161\230\157\191\229\144\141\231\167\176"},{["name"]="unitId",["type"]="int",["description"]="\232\167\146\232\137\178\230\168\161\230\157\191 ID\239\188\155\230\175\143\228\184\170\232\167\146\232\137\178\230\168\161\230\157\191\229\143\170\232\131\189\229\175\185\229\186\148\228\184\128\228\184\170\229\136\157\229\167\139\229\164\150\232\167\130",["ref"]="CombatUnitTable"},{["name"]="partIds",["type"]="int[]",["description"]="\233\131\168\228\187\182\231\187\132\229\144\136\239\188\155\229\191\133\233\161\187\229\140\133\229\144\171\232\186\171\228\189\147\229\146\140\229\186\149\229\186\167\239\188\140\229\133\182\228\189\153\230\143\146\230\167\189\229\143\175\228\184\141\232\163\133\229\164\135",["ref"]="PawnPartTable"}},["fingerprint"]="54b5c723d321d9f3bf3eb4e1d8e8294f8e81ab4ae3822d2422169f21c7b0df70"}
